from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمته توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب أن تولّد إجابة اعتمادًا على المستندات المقدمة فقط.",
    "تجاهل أي مستندات غير مرتبطة بالسؤال.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة.",
    "يجب أن تولّد الإجابة بنفس لغة سؤال المستخدم (في حالتنا هنا: العربية).",
    "كن مؤدبًا ومحترمًا في ردودك.",
    "كن دقيقًا ومختصرًا في الإجابة. تجنب المعلومات غير الضرورية.",
]))

#### Document ####

document_prompt = Template("\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text"
]))

#### Footer ####

footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة للمستخدم.",
    "## السوال:",
    "$query", 
    "",
    "## الإجابة:"
]))
